[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
[POS]
[NEG]
[NEU]
!
"
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
¢
£
¥
§
¨
©
ª
¬
®
°
±
´
µ
¶
·
º
Æ
Ø
ß
æ
ø
Œ
œ
ƒ
Ω
π
–
‚
„
†
‡
•
‰
⁄
€
™
∂
∏
∑
√
∞
∫
≈
≤
≥
◊
##o
##n
##a
##d
##r
##e
##m
##i
##g
##1
##b
##u
##l
##s
##p
##k
##t
##v
##M
##S
##F
##R
##h
##I
##z
##0
##E
##G
##N
##U
##A
##V
##B
##f
##c
##x
##T
##D
##O
##C
##K
##y
##Y
##8
##2
##j
##9
##L
##4
##3
##q
##∏
##X
##P
##H
##W
##J
##w
##6
##7
##¬
##5
##Ø
##±
##Q
##´
##¢
##º
##ß
##ª
##®
##∂
##µ
##Z
##∞
##©
##≤
##ø
##Æ
##≥
##°
##¥
##£
##Ω
##™
##∫
##√
##æ
##€
##∑
##ƒ
##π
##¨
##◊
##≈
##œ
##Œ
th
##in
##er
##ing
##AP
AAP
##on
AAPL
ne
##ll
##or
the
##ou
##es
to
##ar
##at
##nd
##os
##en
##ed
##an
##it
neu
##et
##ay
in
##ow
##is
##as
##re
##om
##ck
and
pos
##ut
##ot
##ad
##pl
on
##ve
st
be
of
##ld
it
is
for
##al
##ee
##gh
##ch
##ill
##us
##id
##ion
##all
neg
##ke
##oo
##ce
##ly
wh
re
you
sh
##ock
that
##ver
ha
##apl
##le
am
##ct
##ter
me
aapl
##ent
##rad
my
##im
at
bu
pr
this
##am
##ould
##one
##ght
##ith
but
##ort
Th
an
li
##est
##ple
##day
stock
so
have
##ell
##ore
##ere
##ust
will
with
up
##ink
not
##th
##ic
AM
##00
##ong
##ark
think
##ak
buy
like
##ur
as
##ome
was
##op
##ir
go
##ess
are
do
##arket
##ook
##ers
##ear
trad
##ap
see
##se
##ol
ab
##pple
ch
##ack
com
##ally
SP
if
##um
all
today
can
out
or
##ight
just
##ain
##st
get
##ig
fr
##il
##out
##ge
call
##art
ex
##ove
##un
##pp
##ast
pro
Apple
we
more
day
##ning
##LA
wee
al
some
would
long
##own
##pt
TS
St
now
##old
they
amp
su
##ant
con
market
TSLA
##ive
don
##ate
week
##ake
tim
##ice
short
##ZN
de
AMZN
from
about
##ood
##ie
10
##OO
##ions
##pe
down
20
SPY
##ought
The
##ab
##ue
tr
##ose
he
##ick
ag
pl
##ul
what
look
over
##ide
sell
Aos
##nt
GOO
##hone
ear
put
Aot
##ard
kn
new
GOOG
has
##atch
##iv
##row
##ost
stocks
cl
le
when
FB
##oll
##FT
MS
time
back
comp
too
shar
hold
##ish
int
##ro
going
any
iP
MSFT
calls
Wh
know
year
##ist
still
Aom
##igh
##vest
did
ever
your
##ven
##ra
sp
one
good
##ff
than
wor
no
##od
ad
Au
##ough
##oney
high
say
##ation
sa
##ip
##ame
##xt
##any
##fter
been
If
##ew
how
mak
##ies
##ind
It
Stock
want
into
trade
##ance
##oth
##ment
##la
here
gu
by
big
off
gre
bet
##ry
##ting
##em
##nings
after
there
##oin
15
posit
every
##and
got
next
##ull
##ash
##ber
bought
uo
##uch
##ity
last
invest
only
had
need
se
##ks
12
##ech
their
##eel
should
##cr
earnings
##ag
##wn
##QQ
bel
puts
could
##ov
watch
qu
low
much
##ine
us
money
whi
##eep
right
iPhone
ll
##ree
##ound
##LX
##ca
##ft
them
then
str
play
opt
##DA
tw
##ase
##pect
##el
own
30
NF
50
sm
##ble
makes
##ous
buying
##way
oth
##eo
11
##fit
NFLX
##qu
##ction
ar
QQQ
sold
feel
again
##so
##ac
##use
##fore
##ait
##orrow
BA
make
##age
en
##eople
trading
mon
im
fin
##ery
shares
price
100
before
tom
But
##ond
add
##ob
well
##arg
##ure
may
its
201
ve
##our
##are
does
##ade
##read
dr
way
##erm
cont
take
##pr
Ch
##du
##iss
close
even
tech
##reak
In
cr
##ci
tomorrow
profit
thing
##pen
##oun
yes
people
wait
happ
und
NV
##amer
lot
start
un
##iz
who
##cc
bull
##oint
##ope
years
##ince
really
##ail
##ite
holding
why
these
##ass
##og
##hing
##ah
very
NVDA
pre
great
13
##av
few
##cause
##io
move
##NB
love
other
##ri
##able
said
position
produ
di
chart
sc
##TR
14
dis
break
sure
month
##be
looking
work
So
##uck
##oss
because
since
GOOGL
rec
##Trad
##act
were
options
##vel
And
term
200
##NBC
##ump
jim
##wit
expect
hit
##ount
run
This
belie
res
keep
##terday
That
You
cash
##fe
most
share
##ia
better
also
mor
guess
##cramer
jimcramer
product
Just
company
##ach
many
those
##oog
rem
What
##ott
fl
##eet
##NG
cap
yesterday
which
##nds
##pport
open
made
thought
same
##ud
##20
##irst
act
val
ret
Sh
##ollow
##ett
wr
##oy
##other
grow
believe
##na
##ang
bl
days
My
per
##ey
##thing
16
Not
point
morning
##per
didn
SPX
##itt
##ors
stop
##market
##ious
##port
##alk
##omet
tell
##ath
miss
DI
AMD
##ank
inter
Re
##ated
##sla
##ways
##orm
##ise
##li
real
##TC
17
news
never
cons
##over
##ually
We
bear
##illion
dec
pay
##ounce
Al
follow
RT
##ence
selling
##ace
che
hope
##ave
lol
On
##ans
around
tsla
##tc
first
app
##urn
drop
##ire
let
Fr
happen
level
25
gt
##icks
##isk
##up
higher
##ny
##if
##orth
##ivide
##zn
##ily
No
Trad
min
##ER
##oc
end
Aoll
CNBC
under
small
being
vol
try
##iday
ind
sl
where
getting
man
##ead
##yst
somet
post
ago
stockmarket
##LL
use
##atter
##az
##ative
##uy
US
##ult
18
##ms
##ign
##trad
above
nice
##ense
##St
acc
##anies
bad
tak
##vent
finance
##ike
inc
##ason
read
ES
##onder
car
They
As
though
spy
##aw
Aove
sw
##ange
another
##ready
##OS
pull
##ices
hard
##BA
bit
##ped
##back
gain
hear
##ume
always
soon
companies
##ating
##urr
##uo
id
##ones
##ntil
bullish
bo
growth
both
far
##side
TW
##witter
might
19
##bl
00
##erv
mov
##ON
litt
Twitter
apple
amzn
##ect
##lf
##ys
already
thr
May
##∏e
##ile
Tim
while
goog
##und
##50
lower
spe
wonder
##ary
clos
dip
set
br
##ert
##plit
##ward
Am
##anks
##vers
best
gap
interest
##ember
until
little
##arget
##ec
come
talk
coming
##OM
wrong
top
etc
##Picks
below
doesn
risk
##ina
##ax
show
trades
StockPicks
something
40
##onna
##bab
mean
##ently
agree
##form
##OT
##less
##ames
watching
cor
split
500
##hn
win
sur
part
##ital
doing
strong
worth
looks
##lease
ent
red
##aj
sal
##ph
tweet
port
went
phone
##ord
green
yet
##ory
##ased
##fl
##ush
##iness
##ividend
To
sense
everyone
##ater
target
dou
ui
##edi
his
##ial
##ich
##uff
##ea
won
loss
LO
Friday
TWTR
contin
ann
##end
##ical
head
##zy
ET
give
el
##ues
took
##arter
##O∏e
How
DIS
weeks
Look
##ever
##usiness
##earch
##erst
##AT
products
##fol
exp
##da
Be
goes
early
list
gr
##ger
thinking
##ful
BABA
##bably
iPad
reason
Now
conf
gonna
bounce
##zz
##ool
support
##etty
profits
IN
hel
two
##bs
##folio
##ian
Market
done
##uge
##ual
report
##IN
##ider
em
##OW
##man
near
Call
curr
saying
##ottom
less
Thanks
##gr
##ates
##self
Aapl
months
All
value
##oad
ask
##ons
China
For
anal
Good
ass
##DX
gl
giv
21
MA
Cook
##edge
fb
hour
Let
bro
making
enough
portfolio
cover
inst
things
##rend
fut
bottom
##ib
positions
Do
##phone
rel
diff
##most
maybe
##cial
##erson
##ations
event
##ced
##tr
ms
##ner
waiting
##ex
##ma
Pro
##ied
##ND
##gg
ord
ph
through
volume
SH
##RK
Mon
find
anything
##ams
##esla
mess
Will
sign
stay
Can
##uts
side
surpr
pretty
##ings
##AS
##au
##30
##arl
##IO
##mm
##LD
##ppl
Aod
huge
num
probably
fall
##ats
plan
spread
help
business
##ize
GM
actually
##ild
##int
Top
taking
sim
##PL
eas
##ither
##ix
Don
names
##ned
underst
least
2017
##kt
##ens
##grad
msft
corre
When
cheap
##reet
des
rally
remember
60
trying
150
##ards
almost
Is
##arge
##WM
##we
##ised
account
##ible
weak
sales
31
##ime
seems
##ention
lead
##ID
seen
##eah
action
##ving
past
weekly
uoC
AT
wish
##ition
Watch
##dd
Still
understand
90
late
IWM
##bt
##RE
##US
bearish
poss
##OK
disc
free
pick
Why
Mar
dont
option
Buy
##app
##Trader
gen
pop
care
away
##ically
def
Yes
##ung
##ET
##ility
search
Gre
Pr
##ptions
##eth
##CL
##iew
##razy
TH
##22
needs
##eb
Aore
Tr
happy
##OP
differ
told
##wh
##arr
PL
investing
##UT
markets
##IX
saw
##ments
##80
lear
rest
##ream
wouldn
80
lt
person
##ik
missed
da
es
Tesla
serv
##ract
##10
##ins
our
##me
gains
##ute
##ep
NIO
dividend
held
24
##air
world
##oom
##ium
##Cap
fun
charts
22
Monday
##fer
valu
quest
##ather
An
##very
##unch
##als
isn
##AL
##60
45
BB
Also
Long
mom
quarter
BTC
Red
SQ
CR
##eed
times
gets
##ness
old
test
##ept
adv
ton
turn
##ware
##99
He
Jan
pur
##In
##pportun
others
##ED
everything
levels
There
vs
ac
##ines
##ower
AMC
highs
else
later
hal
anyone
nothing
##gy
message
##ping
##uring
Bl
##ete
quick
likely
Mac
##ents
##ub
##ES
27
##MT
opportun
swing
ue
te
crazy
##IT
lost
comm
ec
either
##ully
##ics
future
##les
##kend
##ures
NDX
##ited
cle
fill
600
ST
scal
buzz
##OR
Today
SE
##nov
added
##obs
cou
cook
guys
using
ca
##21
Ex
##eve
##ING
57
##bers
##qq
Every
##ont
seeing
##mium
70
PT
check
44
used
sit
Ac
hate
started
TV
av
consider
once
Any
##line
talking
##eng
ext
##cept
28
idea
cost
att
Cl
##alth
exc
sec
boards
daily
fact
##cahn
someone
against
##itz
##ero
shorts
investors
Me
##akes
##ody
entry
##ier
searches
bec
shit
##sh
closed
case
smart
upgrad
weekend
##ui
myself
AP
##90
##ips
line
##ocus
52
reven
##ces
compl
35
##ru
deal
fund
54
ins
large
##rypt
continue
ER
iphone
##ets
key
##aps
techn
bas
mod
JP
##MA
due
75
400
000
55
With
instead
incre
FA
amaz
Puts
luck
##flx
GS
Icahn
ok
##une
##ok
##lier
Some
##hold
300
23
order
scre
couple
Maybe
half
##amsung
##vious
innov
Did
##ta
##iced
hand
pa
120
enter
pullback
IM
co
ROK
game
##omm
Calls
XL
SB
mention
See
roll
iss
ROKU
##daq
pot
kind
26
IB
VIX
##asdaq
##ential
Well
kill
upd
##ajor
De
doll
says
fail
##PS
buyback
##uss
##ata
##Money
beat
##OC
##ities
Or
him
##rs
##Dog
##ars
interesting
Ao
SN
mind
LOL
##orry
nflx
working
earlier
##Trades
CH
slow
left
investment
life
surprised
matter
qqq
focus
trader
Goog
Oh
##ym
announce
##ners
##ipp
rev
shorting
return
change
must
question
##IG
##EN
such
32
trend
##ued
ready
pat
##ote
without
##gest
having
hours
los
700
##val
ah
dump
predi
Thank
billion
range
##arian
New
GME
##ther
night
##ystem
Short
##CNBC
haven
Cr
moment
tot
Big
please
43
##fort
29
iOS
##IS
major
##T3
load
##cy
lows
analyst
##ts
##rand
possible
ty
expl
contract
different
##OD
dev
##UX
##ohn
mult
glad
##ween
Trader
CE
Pl
longer
Invest
Sold
rather
Samsung
##23
reg
resist
tick
##RA
SBUX
##Th
mkt
called
At
revenue
clear
##coin
guy
##assive
cour
conc
CA
Oct
sol
chang
Sc
marg
BAC
##onom
moves
plays
Options
##OU
during
relative
upside
based
fuck
thanks
##oping
Stocks
feeling
uoA
ey
RedDog
current
BU
##cially
Great
##ouch
wants
RedDogT3
DIA
##att
Im
##ots
moving
##11
heard
INTC
frie
Go
##versal
ser
##ved
##oon
##olog
heav
IP
equ
Carl
##aster
##ler
forg
area
purch
Steve
multi
dire
##Capital
pain
##CE
EV
##eek
##ps
numbers
opportunity
NQ
data
##19
##IV
between
gener
47
##utes
##inite
biggest
##ience
##ution
fan
phones
bab
JPM
SHOP
Buff
comes
larg
##Re
Dou
##its
build
##ilar
finally
Ai
crash
Who
##osed
correct
playing
potential
push
spx
Un
##body
starting
doubt
##rypto
##Watch
prices
listen
##pin
wanted
Jobs
##oud
##ared
oC
tax
##ene
proble
index
##trader
Have
uoa
cre
traded
oCO∏e
##ox
imp
adding
Nice
store
pump
##ha
Like
##TM
38
##oe
##ancial
33
Sp
cut
##ield
##ific
stuff
able
##idd
##amn
tonight
##co
predict
##irm
course
130
##pecially
jump
##lud
##ows
##initely
nv
premium
PLTR
AB
fav
lose
##ether
war
##night
each
##IM
happens
la
easy
##RY
sharehold
Bull
strate
she
##ccess
points
hedge
##uly
##hones
42
Yeah
##roid
CM
seem
ahead
##ker
##amp
fast
##inds
coll
##ane
true
minutes
count
sn
##88
##to
active
traders
140
##ug
Should
Only
Pre
posted
##mer
##KE
resistance
##unds
##arts
squ
##fully
##onest
56
power
name
currently
Dis
##ired
paid
Google
##tic
dem
2020
##usk
her
##ves
##cle
GE
whole
ob
One
51
##LY
##ately
46
##AR
##ising
##ength
##book
##eez
given
IBM
full
95
Would
compet
37
##ork
53
NOT
net
leg
##ession
setup
aver
##eter
PY
##Stock
nvda
Bought
After
bank
##ized
lik
home
WMT
exper
ATH
CO
##ption
##Trading
remain
covered
Gl
##stock
suppl
39
till
##ular
forward
PE
Tech
##ift
Looking
SO
thank
positive
Amaz
googl
live
##ton
##ality
iPhones
consum
36
sk
sub
chance
Ag
##joy
came
##AN
Then
##edit
double
Qu
1000
##upid
##enn
##ertain
34
MU
Makes
est
touch
stopped
stream
massive
##orn
overnight
##WD
##CLN
PTON
##fect
PYPL
fig
conv
following
##ify
160
vide
##cing
wasn
##cl
##ision
##ustom
pu
Doug
58
##ict
##usic
##ffect
Hope
##TD
strength
TO
Jim
retail
##ouse
##Market
quite
sent
##oke
reach
exam
beg
##ried
##ividends
Sw
##hh
##alyst
##els
expir
##more
##Ch
flow
tho
investor
Aug
negative
overall
61
65
appl
CL
Rem
TL
opin
##ife
guid
Sept
ZM
million
zero
##cap
##ty
book
beh
trust
ur
Sell
##ten
thoughts
flat
IMO
##ris
expecting
##com
means
##go
##COM
##wards
ra
Ear
longs
includ
amazing
size
Day
##IA
##olks
super
impr
yeah
import
similar
expected
capital
DJ
main
##fr
##verse
rid
downside
Was
gave
##oot
number
RE
##cul
##agine
##oor
exact
uoe
125
##trades
second
NAS
##awk
##ject
pass
##NA
suck
99
custom
##ev
stand
via
##ator
##ggest
##asing
PM
##RO
##where
##ern
definitely
##ari
catch
##ann
stick
del
interested
QCOM
Com
hoping
##ior
launch
##ply
contr
stupid
volat
##TI
110
upgrade
CEO
Got
Most
##urs
41
##pens
favor
pe
##nding
##umb
sing
##action
##ocked
knew
subs
Fin
March
serious
Trade
valuation
Apr
room
story
##ysis
telling
PCLN
##obile
Fed
Think
ME
Mr
ter
suggest
Justin
rum
67
problem
recent
Ne
service
nasdaq
##Pro
pet
##AM
especially
ride
##ony
usually
update
breaks
49
release
perform
aw
bigger
Hey
cy
##valued
Wall
THE
strategy
Even
##ology
disapp
##augh
##aking
holds
mentioned
place
##24
Looks
##ese
except
personally
##UG
##weet
Last
dividends
unless
Air
CC
heavy
##ident
Dec
aut
BRK
##my
##ird
##nb
services
funds
##ided
econom
1st
##erber
credit
bulls
entire
##atio
##sw
along
prefer
hits
perfect
Web
fine
##iter
##lex
09
ON
UP
bid
view
anymore
##DAQ
BUY
hist
folks
170
dollar
##eff
DOW
##Tr
##itter
acqu
Lol
job
pin
##NN
holdings
48
June
##Street
broke
complete
Up
oh
tre
##ases
amount
bring
important
cho
financial
##uoC
##imes
ETF
##anna
mark
##XX
gold
abs
happened
##ging
guidance
Wow
##down
##ient
##Sh
##osure
##attern
##KT
mid
stor
breakout
cause
##ears
dips
soft
dead
safe
##min
##CD
##ST
##AY
Trading
64
ones
shorted
##itzer
##list
##lect
owned
bears
##OST
orders
HD
screen
mist
lots
multiple
Could
found
##witch
Hold
##ulitzer
##ron
NASDAQ
##XY
works
##ajarian
1H
550
med
sorry
##off
2021
giving
JN
example
##Kass
##quid
##avid
Ok
cool
##ides
alert
bi
result
Feb
##osh
opinion
Peter
ste
##ounced
running
lim
sus
success
Vol
hur
##abl
##Live
##Pulitzer
##77
losses
demand
##rew
##iment
##igger
DougKass
single
##ially
learn
JustinPulitzer
##ng
##cess
margin
AD
##Invest
USO
analysis
solid
gone
print
become
Here
gam
##rr
##olute
trillion
spreads
obvious
SNAP
peten
85
NE
pan
##mber
##aha
##arren
wall
##ster
##eta
explain
rich
##ric
Buffett
CMG
##ne
pres
knows
invested
enjoy
rate
plus
cur
announcement
petenajarian
Time
##money
##inh
##invest
##Bro
excited
People
ya
contracts
cand
kid
##yn
reversal
twitter
Sm
##ney
video
sound
couldn
confirm
AR
##bo
arg
##pensive
GLD
buys
supp
MM
par
hy
record
innovation
average
Put
180
APPL
59
prop
##ational
imo
reb
Glad
BID
certain
##hip
##iting
press
fair
uia
##gn
##CO
##ude
indic
discuss
largest
##ined
repl
##onm
form
honest
##der
##uoA
Amazon
total
##CH
##ode
supply
Wait
chop
blow
USD
ETH
weakness
health
2013
##nbc
pattern
##astMoney
##cent
##The
##ged
tweets
##17
##enny
##ament
##ongr
worked
eye
Please
div
lov
switch
paying
##ommend
FU
NKE
##ros
##olid
##ries
losing
BIDU
Need
batter
##13
##ino
##formed
##dam
rele
word
keeps
correction
trans
join
##ss
##25
##aught
Squ
##reci
##cri
infl
sitting
bill
##BO
##itch
imagine
recommend
Are
cat
shop
analysts
ARK
FS
Tues
offer
recently
direction
66
ip
tank
expensive
manage
meet
track
##VE
CNBCF
friend
wanna
ppl
##ga
liquid
prov
155
##icha
brand
divers
bur
##onmusk
bot
##NC
##eas
##though
##ods
Its
closing
##pm
##essive
##berg
appro
elonmusk
CS
##NY
looked
CNBCFastMoney
##not
Scott
Does
Very
answ
##empt
##aa
three
increase
BT
crypto
missing
Man
fur
##ky
05
IS
Keep
These
Android
##RT
mac
yield
Tom
haha
strike
kept
meant
Feel
Love
boy
opp
##itcoin
##ified
##eat
##uc
##wise
tried
priv
thru
##rist
##oring
takes
non
model
COST
mostly
##reed
within
twtr
El
##ling
##son
##oup
trigger
inf
CRM
##ales
##iving
##appy
XOM
##ana
recover
system
artic
bond
##12
buck
##trade
squeez
VXX
##GT
dra
damn
##acy
LU
##Book
##On
hardware
shareholder
Dan
yrs
115
AL
##14
##IL
software
jon
aren
advice
publ
##CT
consumer
Add
Dividend
##charts
##ploy
sale
450
dig
AAPl
##ctor
145
begin
##esome
LT
Earnings
exactly
Guy
cnbc
respect
baba
April
stud
thinks
calling
issues
cal
##CK
decent
issue
BE
Ind
SL
##ANG
light
norm
rock
##AG
2022
JNJ
##ley
App
##of
##iot
##Cl
stops
##rade
comment
2000
Dr
pie
##ueª
technical
fam
##FE
Get
Mad
##ober
asked
buyers
continues
Wed
max
trim
##ives
deep
mar
##lines
##NK
spot
learned
##LO
##TV
cant
worried
Been
surprise
VZ
##ald
house
type
AH
July
depe
comput
153
##esh
2012
drops
PUT
wk
##lt
lately
##uce
Thurs
Br
##uth
hands
content
futures
volatility
Same
log
##ILL
Face
Never
hell
##uz
reports
##KNG
sentiment
TD
##ikes
##essed
behind
Risk
##Trade
Had
amd
tells
John
Rob
##ured
progr
fundament
##oat
##illa
suspect
Your
##unk
##atever
##rian
disappoint
##olutely
250
battery
dumb
ua
##aB
2019
Inter
AND
Ke
LC
prom
priced
sch
feels
purchase
Wish
music
##now
##by
laugh
needed
buybacks
NO
##AD
towards
possib
media
Too
det
fear
taken
##br
Che
Bitcoin
FOM
##lor
DE
played
air
momentum
##reme
buyer
##ken
gotta
quality
bal
manag
Seems
answer
IT
wow
Next
Le
bc
appreci
##lies
##used
devel
##ency
compar
cross
breaking
##ificant
##noon
##come
##atform
175
consolid
##FI
MR
##LU
##EE
dropped
Nov
Warren
bag
resp
keeping
NY
Sir
tight
##yle
caps
impact
Of
Mic
##osystem
reading
further
Su
yr
More
##oft
135
##point
carl
sever
Act
fly
afternoon
Cap
Other
effect
##time
##eric
exit
##trading
##raday
Tuesday
ref
However
inv
2018
BBRY
ALL
##view
98
YOU
often
rep
##unes
picked
Con
CAT
Hal
##mas
results
mad
platform
Closed
forget
sees
allow
Best
fix
hor
##ays
Somet
tough
Real
EST
shows
significant
Sorry
FAANG
Bear
dollars
##ux
##rible
design
ev
##GN
requ
Trump
##ORT
MET
StockMarket
followed
Ar
RS
##uation
deb
spend
Everyone
##aked
##phones
technology
base
eng
devices
##KS
stra
bun
Nasdaq
TM
Took
totally
DD
Over
##GO
##idence
##asty
Val
Holding
DO
aff
KO
##18
ecosystem
##iterally
WH
fla
tap
ideas
##rader
leave
worst
##USD
table
intraday
crush
Squawk
530
GO
ed
##VER
##ushing
worry
monthly
##UR
cheaper
01
fight
rise
##pite
RedDogT3Live
uce
##arry
##WDC
68
First
hed
sum
##tw
##ulation
MacBook
Ph
165
leaders
##med
space
adm
ign
##Tech
reminds
retest
##usual
targets
Cramer
debt
lotto
grab
97
WWDC
gives
BY
Pay
hey
Remember
rip
smarter
funny
En
##par
ups
##bled
filled
completely
63
core
##ying
weight
Black
Gr
##work
regard
face
EPS
O∏e
bre
##inal
discount
AS
##cast
moved
bunch
Out
fed
note
figure
wear
##ole
##ivid
##irt
##race
##rib
public
CV
Tic
##boy
##aki
cannot
throw
##anilla
opening
exposure
estim
dist
crap
showing
92
Ben
basis
Going
##rosoft
lock
##py
##200
sleep
considering
Back
hot
##15
##PE
alone
##arely
Thursday
Ab
##BE
105
Net
##ailed
remind
mistake
bub
growing
apps
slight
scalp
history
MCD
##ule
##ages
DKNG
PFE
fit
##oid
##laim
simple
##rupt
CALL
MO
economy
##trend
wondering
friends
##ichael
straight
04
ow
uec
##AC
mem
420
mine
whatever
Cash
vers
sells
Where
worse
From
falling
##intanilla
mobile
##gether
##ished
##elt
Volume
cents
hasn
##QQQ
winners
extreme
##quintanilla
killing
WS
##ini
carlquintanilla
##ius
##Mc
##yr
##ida
##icing
Which
met
init
##agree
##obal
together
##vert
greed
##Broker
96
iWatch
rot
tl
insane
GL
##ants
class
Really
##Tick
decided
oil
##just
thats
announced
stores
2nd
ball
pol
##ube
##ews
Ratio
feed
##VXY
##ulous
Bullish
block
minute
quickly
TR
caught
##tain
overs
panic
##nes
##rd
##uf
##SE
##Al
board
avg
changed
META
Gold
ba
##iction
##fast
signal
cycle
##por
##asaki
tri
earning
Americ
03
OR
Reformed
brain
basically
TicT
##Kaw
Price
experience
article
2014
squeeze
TicToc
##ugg
##ored
ueA
LCID
TicTocTick
Jeff
VR
##55
Things
realize
ui∞
curious
##ongrats
Mor
rates
exec
however
percent
several
Gerber
imm
specul
closes
SM
coin
fade
mag
regr
unusual
easily
kids
##Kawasaki
ap
poor
##istic
##othing
08
users
develop
team
Tw
bene
deli
cars
Microsoft
Ret
bus
##ai
##haps
process
520
dom
##oly
reward
Inc
happening
##inese
date
##inger
profitable
decision
forgot
direct
subscri
iT
Those
chain
Street
While
disagree
Watching
##while
David
iw
##get
##cross
individ
Anyone
GerberKawasaki
##FC
premarket
##ui∞
prot
starts
lack
uea
##uit
didnt
##ONE
feat
##load
putting
expectations
LONG
UB
##16
##osing
##iel
uoN
##like
##oku
fucking
Comp
ble
literally
##oooo
##issed
partic
favorite
94
Gu
##mont
##iff
##rying
user
concer
##inhood
OTM
##Options
##enty
save
previous
##idding
ReformedBroker
Per
PIN
##str
TGT
step
##opt
send
watchlist
returns
control
tm
bell
noticed
##aving
margins
69
SW
Facebook
balance
##ees
##37
RB
UVXY
bar
##te
##RC
weeklies
##ERY
awesome
afford
Curr
Jon
ipad
88
AV
2015
##itzstock
individual
07
beats
opened
mini
##mt
kinda
competition
AA
Week
john
##red
##ming
state
eventually
btc
kick
##illy
absolutely
High
Since
##dy
refer
##apt
##bling
FANG
##uary
whales
downgrad
##net
##ueº
SELL
loaded
Dow
Option
uO
##led
##PI
##ury
##credi
OK
##fin
##fli
device
indust
turned
CSCO
Bet
##eal
##ien
anyway
Plus
GI
Nothing
OS
fell
##iculous
opportunities
baby
Wee
tur
zone
shot
02
##con
##ism
##ivot
##pha
becom
GP
Happy
rul
sad
##pro
exist
##eeps
broken
tickers
##SA
##RI
flip
obs
##af
prof
fire
##cs
##erve
thes
prior
SHORT
AC
law
##DE
##ief
##oseph
IV
across
##To
Another
failed
PC
##esting
chips
building
iTunes
5G
hol
prob
##ended
Green
bubble
ED
OI
Thought
chip
orig
friday
betting
##ahah
asking
shareholders
competit
including
piece
Siri
##Don
Christ
##wits
compared
attention
Brian
nio
##ran
itself
approach
sector
manip
sometimes
email
##irl
flush
tweeted
800
UPS
front
forever
Str
reasons
common
September
560
FC
Right
biz
##nn
Chinese
otherwise
DOWN
Might
boun
comments
##ivity
77
Mark
##NT
research
TLT
##ua
##tf
whether
##ilt
Stop
income
despite
extra
equity
Disc
convin
HOD
##aut
##ples
January
candle
inflation
bucks
##montana
##iven
difference
##ipping
larger
honestly
MRNA
tlmontana
##flix
93
ug
everyday
##erman
hitting
##perform
speak
performance
##lorida
dropping
heading
avoid
catalyst
meeting
Money
fa
##ators
##cif
assum
IPO
##Report
##nesday
EX
DJIA
##yy
ARKK
Hi
ran
##sel
540
Ad
##arb
guessing
followers
seriously
By
ps
##iy
leading
oversold
North
##TF
##ale
TDOC
wind
wave
Premium
customer
06
Ha
##hedge
##ters
AuI
ticker
info
BYND
BS
fake
##gan
##lus
##isit
overvalued
##ftime
ways
undervalued
Probably
Didn
580
Res
staying
Fox
penny
##oh
winner
lucky
replace
##ison
##rowth
customers
LULU
EOD
##Bl
charg
nearly
stuck
TheStreet
199
careful
mis
exce
2016
##ument
##ably
##uoe
Keith
lo
decline
streaming
PINS
odd
##street
investments
employ
Buying
review
benefit
dest
##low
mega
##oph
chann
lets
setting
assume
repe
simply
hurt
owning
thesis
BUT
NOK
Rock
RIM
gift
lunch
wife
##oof
SPOT
112
##urns
Down
Joe
##Adam
SPCE
bitcoin
XLF
DJI
87
UN
hum
##PT
##aying
trap
##fortun
cult
##atest
##aper
access
570
typ
eyes
present
WY
card
sett
trou
Ask
74
reaction
ant
Trades
normal
felt
link
sat
adjust
128
bonds
concerned
##oz
##ergy
decade
screw
ridiculous
jonfort
possibly
##ufact
460
##pped
create
ADBE
Both
Sep
##lin
self
CCIV
Elon
jonfortt
##how
##EM
comfort
Order
Wednesday
appreciate
protect
BIG
Come
mr
##land
##angle
crack
raise
##pic
##RM
##33
questions
October
limit
SJ
##II
spike
retire
specif
management
Tomorrow
GILD
86
cc
rall
##Florida
stat
##anger
smaller
News
350
plenty
##McC
##let
##Event
confident
APPLE
chat
##istics
Hedge
jack
##ises
posting
write
peri
special
advant
rumor
Cor
ce
walk
complain
AAL
##HO
although
computer
busy
##BS
##tern
Once
Lots
col
##uh
##HOO
##che
usual
manufact
splits
##oomberg
COIN
zerohedge
diversified
Halftime
Alex
Give
God
ele
##VI
##xy
##arm
weird
env
TraderFlorida
##olution
127
consist
family
##ama
season
concern
greedy
62
LI
##irus
uoO
CRWD
Buffet
indexes
FOMC
domin
Open
Spe
TTD
chase
energy
changes
Iphone
Many
Us
latest
sick
##uia
##iny
##ering
##illions
##stant
black
party
setups
GuyAdam
ugly
NOW
willing
swings
525
GuyAdami
FED
sort
##ewie
hearing
wins
Because
avail
focused
78
mach
pivot
##ring
##CA
##DAY
okay
CNC
FT
##dx
scale
extremely
##cember
learning
conviction
holiday
WYNN
£u
##uk
wont
hype
fool
fully
##OL
cond
##NKD
mo
##ustr
trail
easier
UBER
DM
Te
YHOO
rob
##bed
##ullough
drive
patience
pict
pressure
Fut
Id
Made
Take
bey
fundamentals
admit
GPRO
til
##SY
##izing
beginning
IF
##ani
##urity
patient
smartertrader
Fri
TA
tv
##App
##Pr
driving
sounds
slightly
430
Pat
indices
Agree
choice
Cons
Damn
scr
##agi
nicely
190
likes
89
mort
##66
118
closer
AI
dam
ill
##ios
##BV
beyond
##aul
Store
ended
##Inc
AirP
b4
##nect
decide
rebound
RSI
##egr
inside
##ability
scared
liked
rules
72
Geek
Sam
Tell
elect
incredi
plans
##aged
owns
regret
CNCG
tired
##Dividend
##47
##ety
outside
trick
recall
Christmas
convinced
GT
sem
tal
wild
street
advantage
Co
hang
##right
##erence
##ares
##rowd
Markets
personal
Crypto
chall
project
TSM
selloff
terms
runs
winning
broad
August
certainly
MadMoney
Jul
##ION
god
AppleEvent
offic
idiot
##ipped
general
##Reversal
##Stocks
Northman
##astic
##ands
December
##ISH
RiskReversal
program
Netflix
##UM
##AK
##CP
movement
Check
HalftimeReport
##86
##que
reverse
##ocket
truly
blue
peak
Robinhood
##fortunately
NorthmanTrader
PS
affect
er
##Su
Guess
##selves
220
Follow
##oman
##iling
crit
##Donald
KeithMcC
boring
lines
##aim
##Fin
##500
timing
hopefully
##oop
KeithMcCullough
banks
nerv
##mao
period
PG
Ser
af
iPod
Chart
leader
channel
OP
tempt
##king
##ops
clim
production
##uoa
Max
SMA
picks
vac
##yan
##osite
Start
##ovid
realized
Added
trouble
Hmm
##ze
##erry
Ste
watched
She
accounts
flag
84
pushing
##guy
##TH
##gressive
440
Waiting
Sim
joke
tabl
##iant
beaut
dog
twice
pulled
575
immedi
RIMM
roku
antic
clue
119
ABBV
##OnCNBC
Interesting
industry
MadMoneyOnCNBC
penn
##Mac
##89
##otion
##alax
##olic
152
pers
##GA
##WS
##ived
shouldn
closely
EUR
La
fad
##gage
pricing
mins
accum
reporting
obviously
RBLX
mil
rad
rule
##kers
##wd
##owell
revers
addition
Beats
Someone
Value
tape
original
73
Hard
dan
##gt
##AX
prin
social
traderst
scen
tesla
words
SMH
traderstewie
GDX
ain
kidding
strugg
##black
helped
PLUG
##laimer
mer
yourself
Investing
dream
rece
##iring
##apner
spent
Rec
risky
handle
ETFs
3rd
HA
cop
cuz
##TS
sheet
114
Inst
Es
ske
##set
##iously
76
BL
FY
LNKD
ma
water
##arily
train
blood
eat
##bit
private
engine
Gen
rising
##123
##An
2008
470
bias
nervous
qtr
ratio
sour
##host
##70
##iding
react
hah
555
XLK
killed
SNOW
collect
##2004
82
##atic
integr
ABNB
supposed
anticip
Person
occ
##GE
aggressive
caut
wake
##ball
##uing
##uct
##ka
##he
##HT
android
##ively
##ueΩ
nobody
##EST
purchased
summer
##alaxy
Break
RI
WFC
lag
##aL
##cal
##OY
##ening
##aced
Bloomberg
expiration
Wor
tend
yest
##ances
##aph
sellers
lever
saved
confused
91
Bill
Has
vi
##ena
shut
##ollar
##aging
optim
Always
conference
global
valued
ScottW
AF
IRA
LE
TE
Yep
crowd
die
##Burns
claim
FUBO
provide
opposite
available
GD
ITM
gary
##tt
##enge
listening
Mike
nft
##uzz
##lind
recession
sucks
##Trump
suppose
tmr
Jun
sym
##IC
##HC
##asy
##entr
terrible
rumors
picture
ScottWapner
FOR
JD
##fly
wel
deliver
Weezy
##iyagi
mortgage
Eur
bra
lapt
wise
##err
##entially
108
cloud
entered
consolidation
##for
##xx
##ych
##erd
ish
##Str
spending
group
Lu
oper
##Qu
Profit
comfortable
Int
Trend
Tweet
mix
Amzn
MarketR
ScottWapnerCNBC
Fun
MKT
cir
camer
sil
impressed
estimates
MarketReb
480
PR
##iron
falls
heavily
##ariff
MarketRebels
Power
##ipe
##gen
highly
gotten
Yesterday
clearly
colle
privacy
Fl
##iam
##bol
##40
157
eff
##isition
##ubble
Expect
##itzstock2004
Ber
##zon
##outh
##aren
tra
117
##TRE
upgrades
loved
##osephBurns
SJosephBurns
TF
##mon
##gre
##Sp
amc
103
##cret
perhaps
lesson
rolling
alerts
590
faster
hmm
##Miyagi
##UN
##icult
##aces
##iful
##alt
126
broker
factor
Small
##uoAuoA
Disclaimer
WeezyMiyagi
Haha
ID
YTD
##BL
##ounds
116
Although
TWLO
text
school
Ob
Sure
math
rough
##iver
##ered
charge
##ointing
Chris
wrote
slowly
TLRY
histor
crushed
Tot
jobs
##iest
hamm
##the
abt
draw
Something
DOC
TDA
tasty
##eral
notice
covering
genius
545
83
btw
##ii
themselves
61point
environ
650
Car
##mark
##play
china
partners
redu
doubled
Hopefully
rotation
61point8
Ed
Fitzstock2004
mat
rn
chasing
assets
Lets
##IVE
indicator
Mel
##All
##ieb
pltr
uoCuoC
Agreed
GR
HIT
AppleWatch
##OCK
##iddle
related
Analyst
snap
acquisition
##black00
garyblack00
79
Adam
LMT
Se
##ham
actual
checked
updates
dumped
healthy
EN
barely
uß
##igg
##pping
boat
confidence
Blue
Def
##ymco
argue
EDT
destro
TRA
##EL
##GC
howard
##andy
businesses
consumers
AOT
GN
paper
##BT
##cer
##rav
opens
request
AirPods
##lindzon
SA
hop
pm
##hire
##onic
##esides
##elly
realDonald
mode
taxes
howardlindzon
realDonaldTrump
MY
OF
ment
##mo
##87
##llent
##arant
built
posts
210
##board
Personally
LRC
##UD
##LI
##ario
comb
death
iPads
difficult
IMHO
released
BTW
cautious
##War
##arently
meaning
valuations
teach
##coming
hat
##ye
asymco
unlike
pays
accept
environment
Dear
Honest
none
##AO∏e
##ails
sideways
planning
Michael
YM
round
onto
123
gaps
loading
Russ
moon
pts
highest
monster
instit
Pretty
##meis
boys
##usa
among
##uru
138
reality
liking
billions
Currently
AOTtrades
oAO∏e
##look
##45
##ustain
122
129
acting
2day
##dma
##iet
##TA
finish
google
##no
##aid
##atur
anywhere
##pective
YouT
problems
bleed
Alert
81
hmeis
mc
tb
stake
##rades
AppleInc
sav
##oyal
##onster
##ddy
Disney
successful
Weekly
Better
hmeisler
bash
ju
##SP
##ho
##ites
##ossible
stronger
version
900
##face
##OV
##olved
109
##kshire
box
figured
disappointed
JM
Paul
##bought
##ording
announ
liquidity
HP
Mc
butter
107
sharing
505
retrace
blog
asset
IPhone
Unless
515
PUTS
Futures
Kind
TQQQ
##ein
##News
##olf
daytrading
reported
Aoall
fanboy
expiring
Morning
GRE
Sur
##ress
##ivers
##BP
##yt
##82
shake
Thx
compare
##odcast
Rev
##UST
##ruct
increased
reached
immediately
welcome
YouTube
AN
BM
Hell
Powell
uou
shall
113
USA
LOD
picking
attract
Congrats
Mid
awhile
pure
session
##FO
##43
pros
outperform
leaps
smartphone
matters
##UGE
EURUSD
##TREND
NK
row
##aring
final
##ounter
rolled
##100
##ission
147
True
valuable
Everything
Bro
nuts
##RG
##HS
##imul
##ueæ
##izon
annoy
SOFI
iwm
machine
5s
510
waited
phil
clean
##ucid
Phil
CCL
freak
vix
##van
frustr
noise
signals
attempt
equities
confirmation
DOCU
DP
Q1
jeff
tag
shocked
##aker
##abolic
##priced
172
cares
worthless
435
choose
##Investor
macro
71
Pos
lmao
##alls
popular
EBA
silly
##Sch
lif
connect
##ables
##elie
insight
volatile
COM
RO
rips
##TE
forec
401
expire
stays
helps
choppy
settle
EBAY
1k
LV
loc
alloc
ETSY
particular
repeat
scenario
Da
¬∑
##vant
##Gr
##ulate
monit
testing
increasing
innovative
##stocks
Berkshire
bb
##using
Theta
Close
Again
Financial
POS
##ted
##OG
guide
smell
139
commer
situation
SLV
johns
Thoughts
Make
Q4
Set
Saw
##27
style
##emic
##anding
entries
attack
regardless
Dollar
Mobile
NET
pair
##gory
##Ghost
##PP
tool
Stay
saf
everybody
##aves
##otta
Show
##attle
wallstreet
specific
forecast
RIG
gut
ramp
##occ
proud
defe
compete
intro
Smart
Target
dude
pack
sq
beating
shift
Their
depends
becoming
mic
son
##SS
##PR
goal
133
letting
commun
AVGO
HUGE
MT
gme
ut
##hor
##Bull
##Of
known
holder
132
minim
##LLC
565
include
1T
sb
wide
##res
##bing
##AA
headed
study
Sometimes
perspective
pt
##BY
##84
##onse
iPhone5
143
2007
heads
auto
##GM
##raid
2009
jumped
##erbert
bounces
Tick
fat
firm
tariff
##94
##LF
##£ø
##onks
##ades
wealth
heart
boost
##arlic
extended
listened
FE
##ns
##eg
##mp
##ALL
##Pl
somewhere
guarant
121
111
unc
feature
Meliss
##imulus
Bar
sir
##ahoo
137
sooner
MARA
security
XLE
425
Selling
riding
edge
psych
##Finance
Honestly
Bears
Cont
Fuck
Herbert
nib
##ges
##bn
##itions
young
overbought
created
Finally
camera
johnscharts
Sl
gm
gld
##uber
##cut
##PH
force
web
##ivate
154
blame
Spot
##RTarlic
LRCX
HerbertRTarlic
HerbertRTarlicJ
rational
##VID
necess
##ceed
shoot
##aken
##izz
144
##ification
skill
PeterGhost
American
downgrade
Europe
AX
ir
##Val
##OX
##ORK
##inner
##iger
turns
majority
regular
##Trillion
##ranov
tmrw
PeterGhostine
Galaxy
Luck
##gies
##uu
##DD
upcoming
impl
corpor
CHAG
changing
PEP
##capital
improve
Tsla
VOO
ult
##ji
##etch
2010
##duc
Sweeps
Actually
afraid
Aut
millions
##iots
##reat
interview
pulling
discl
amazon
subscription
beautiful
bounced
##twits
thread
##arc
online
prim
##ists
##gging
Amazing
Above
turning
230
Free
Want
WTF
hund
road
##lo
##MC
##And
##Cr
stockguy
leaving
sax
124
intern
talked
acct
465
initial
challenge
1M
Jack
##oice
##oard
##aud
##RN
##74
##icy
146
##TCH
Play
polit
Two
assuming
stockguy22
FIT
Know
Tony
##dr
ship
##ival
watches
puru
##inhorn
argument
saxena
dad
hi
king
sustain
##ext
##iers
##LR
##etr
##ovember
office
uni
162
Read
sweet
entering
incredible
Billion
WE
tons
##eak
##kk
##28
##enc
##imate
##iled
##rior
148
boom
THAT
warning
##ennis
SI
strangle
Almost
partner
LOVE
ueª
fails
predicted
WSJ
ORCL
Especially
Des
Nick
Off
Wind
tiny
vision
##Bell
##inn
neutr
##real
##oved
##pres
##ogn
##bles
##ship
ignore
laptop
2x
Ramp
WILL
os
dep
uoi
expiry
limited
rallies
TC
grand
sens
##amb
cance
##berry
iPhone6
writing
##eady
reasonable
Investors
EVERY
Thinking
GDP
280
Business
Count
five
##nment
##erM
somehow
prep
parabolic
Doesn
##Strat
1Trillion
CP
Crazy
MD
Wonder
david
ten
##ki
##VA
##ories
##elling
TheM
##uea
ads
continued
correl
response
SQQQ
TIM
Until
counter
locked
uu
##pa
##Say
##andom
149
##ucks
##udge
##awks
##REE
THIS
##ipper
pumping
premiums
shopping
tem
vid
##ja
##isions
alot
10k
102
##rage
142
brought
tweeting
LOW
events
Super
NKLA
GA
Musk
four
pissed
##nk
##pay
##eren
invent
##ires
gover
10x
lean
fint
Thats
helping
became
535
585
Gonna
HE
Work
cell
nor
##ooo
##thony
106
##crib
monday
emotion
CHK
retirement
skept
##occo
neutral
5S
Less
SND
fant
finger
##gos
##RR
marketing
hundred
Bad
Home
ge
##omen
##unster
101
185
SEC
correctly
apples
impressive
UNH
Bid
ben
##New
living
##abor
##asses
##formation
ATVI
##shit
coff
terranov
wkly
UPST
November
Sch
##mg
##Res
##GI
##uted
truth
uses
capit
remaining
fairly
Trying
forced
button
##unt
constant
##ager
##quare
##overed
##ajoe
##Brokers
trimmed
logic
talks
tempted
destroy
Growth
Gotta
Hero
VERY
Went
eu
pand
third
##raz
strikes
enc
Traders
screens
paul
##StockBrokers
Capital
ThingsStockBrokers
MKTcap
ThingsStockBrokersSay
Either
QE
bac
jan
##69
##ola
exited
##ulated
knowing
beta
slowing
gamble
comparison
Active
terranovajoe
Cal
O£ø
congrats
ple
##44
##eted
##radd
COVID
recovery
faith
Funny
Cat
DAY
Hoping
dark
uc
yea
156
##uck2
payment
losers
mainly
Steph
Windows
Yup
master
##monster
##ients
##Squ
##FA
##wor
##APL
##ara
uptrend
##irms
canuck2
##ains
anytime
diver
177
according
##ATE
considered
revenues
loses
FOMO
##fastmoney
symbol
canuck2usa
Aw
OM
Q2
loyal
nailed
##gs
##utions
quiet
##acing
doesnt
flash
floor
##overs
showed
240
OptionsTrading
managed
Serv
aud
gun
maps
path
rent
##Br
##ano
##pex
##uec
bets
##CapitalLLC
videos
FSLY
cnbcfastmoney
FDX
SU
alex
##aire
##sma
##watch
##76
##enter
##asm
##uel
technicals
involved
brainer
Appl
Huge
WTI
cent
camp
michael
##je
theory
aside
trash
##icked
##iper
players
breakdown
accur
445
Reminds
##weets
FSR
regarding
RampCapitalLLC
Comm
Matt
SD
Sund
middle
##kr
sudd
##weight
swinging
costs
prediction
members
##option
excellent
introdu
Ah
bed
cate
lu
vis
##Sense
##31
stimulus
##ASH
Bulls
passed
allowed
sudden
FX
King
ban
bail
##HA
owner
TVIX
squawks
directly
employees
tablet
squawksquare
WISH
ends
##will
##iles
relatively
country
expert
CVX
##arbage
Daily
260
5C
VW
##Ex
##iller
meas
outlook
##stein
downtrend
unf
##2020
Note
surv
MMM
Enjoy
trailing
PH
Tre
##ooth
thous
##ctors
holders
statement
490
620
Lear
Mini
Pel
cv
dave
vote
##hard
##CR
##26
104
134
maintain
GTAT
##aLee
college
Lucid
Taking
Und
naked
##ket
##ME
##FD
##01
##Talk
##85
##jarian
bud
frame
##elp
Dont
bankrupt
##NYC
calcul
SWKS
LOT
Music
educ
gas
jonna
tgt
##dog
##tos
##LG
##omed
advert
2011
##2011
idiots
phot
generally
sticking
particip
MelissaLee
Ev
JCP
Key
aware
games
vert
##mith
##Mo
##hic
##woman
##rect
beast
##key
159
optionmonster
Swing
loving
distrib
HeroDividend
jonnajarian
4th
5x
DAL
cry
cards
land
##de
##oul
##change
##urd
owners
crm
##itty
brings
signs
Watchlist
Trillion
esp
Exact
dumping
Investor
Seriously
age
besides
fs
weren
##Car
##anc
##etic
##orts
##urg
##ously
Ins
conserv
##ension
Investment
Getting
FCF
odds
MelissaLeeCNBC
Jam
Ty
bust
danger
pton
wmt
##ledge
##Mike
##54
pract
131
##ottl
apparently
pops
models
Techn
Bearish
Goldman
##options
2k
ANY
Sand
gs
##iw
##care
algo
##OOOO
clients
##iped
##cipl
harder
speaking
patent
remains
contrarian
trends
offering
Acc
Cath
DB
neither
##anced
##edict
##INK
Imagine
depend
features
FYI
Spotify
Sunday
py
pile
##gard
##otech
fort
shock
lie
##ilities
##ags
appears
##phir
stayed
##999
focusing
NYSE
match
##light
reject
##acker
##umm
overpriced
##odel
##ization
recogn
rocket
##Cloud
fitness
balls
##Support
320
Mom
PA
UA
dun
iMac
perm
##ZZ
##omas
download
lottos
##ending
455
warned
##Warrior
coffee
List
TT
nq
##ature
##essage
internet
annual
cutting
SquawkStreet
grabbed
officially
680
Rich
XR
borrow
crypt
tail
##FM
thx
##itive
sand
##ERT
ground
sidelines
commod
delta
promise
travel
3x
Live
Ma
SS
barg
garbage
ke
meta
##ML
##EC
##OOD
##ideo
uoE
drink
quarterly
exciting
##oking
##ENN
##otection
Definitely
LA
Ophir
dated
eth
girl
##Mr
##WI
gov
##apped
ability
art
unfortunately
disrupt
misses
BBY
##ENT
##evin
MELI
##investor
##uceuce
hedged
referring
LaM
printing
RIOT
commercial
government
##ottlieb
Bob
EU
Fib
NT
Yea
foot
karen
##bly
##ora
##ppy
##oving
unit
##ERS
scalping
##ommy
475
##Profit
burned
becomes
attractive
Ms
RUT
Win
bout
ris
##pad
stage
ang
everywhere
forming
manufacturing
partnership
conservative
Bank
M1
Min
Port
Post
RV
SK
Yet
Yahoo
##Fr
##fi
##cise
##97
##onav
##enry
##tered
prove
suff
##Traders
270
delay
economic
comparing
SquawkCNBC
Meta
Missed
band
matt
park
ss
##wart
##anie
char
Stat
Stri
##ista
uo¨
##what
ess
network
##aBuzz
election
AFRM
GNUS
##onicaBuzz
pypl
LaMonicaBuzz
290
360
Einhorn
Mind
irr
##note
##agh
##rus
##NX
##ww
steady
stockst
StockT
smh
units
swear
uiØ
headline
advance
indicators
loves
CVS
charging
##lining
ThetaWarrior
Exactly
Mo
MIN
eric
##ugh
##kn
##GG
##Guy
##Gottlieb
webs
BAT
167
##athan
triple
window
RD
Yo
stradd
205
driven
##awan
fucked
terr
confirmed
additional
OphirGottlieb
610
CGC
Jason
Much
Talk
err
ripping
##dall
##QSense
##ishing
unl
raised
autom
Daniel
normally
laws
Strong
adjusted
screwed
Del
IC
PRO
RKT
iCloud
mt
moat
pun
##PM
protection
##seym
timseym
scream
concentr
impro
releases
statistics
savings
timseymour
Cy
hes
page
rap
rarely
##box
##td
thus
##otes
reli
outs
prem
MarketWatch
##AST
tested
tracking
horrible
iwatch
Instead
butterfly
pandemic
IOS
Mkt
OC
VTI
WK
bread
mm
sides
##cott
##Tree
##We
##etrader
##ici
chris
1500
appear
quarters
Quarry
books
Okay
burn
390
Based
Given
OUT
Pete
Sun
lay
##ened
##007
##irth
child
todays
##duct
##aterial
Plan
Quick
perfectly
##Alpha
anti
optimistic
##Spider
##onavirus
Abs
Low
iphones
narr
pocket
rush
random
##Ar
##fc
##83
##utch
##aine
stress
payments
Mean
ordered
CLOV
financials
mistakes
proper
##finerman
manipulation
TrendSpider
uncertain
Cathie
CB
##zing
##jack
hack
141
movie
ui™
upgraded
##ippy
determ
##ALLY
karenfinerman
bother
site
##gence
##PN
##asc
former
##chan
##oli
worries
sept
arr
blocked
indeed
tops
##ensus
225
STUD
computers
Otherwise
About
America
5k
Jo
Josh
Sil
iron
zm
##ada
##urch
##olo
uoU
facts
CALLS
initi
Haven
Cle
CNN
MJ
Master
epic
##vis
##Bear
##esus
##celer
##apse
makers
##lah
seg
discipl
pulls
BULL
ONLY
India
combined
Bah
Gap
HO
HFT
Own
Ryan
Way
cos
ndx
##Sn
melt
##anta
##blem
##print
valid
90s
Quest
significantly
leverage
STUDY
330
James
Link
uee
ver
##75
##atives
##itrade
##etz
shortly
seller
backs
adds
bullshit
195
speed
tanking
##ILLION
tariffs
AXP
SNDL
AG
Sn
Sounds
bon
##GB
##yrs
##ining
theta
##oton
##urry
##igr
##icking
151
innovate
##OUG
behav
##Closing
requests
StockTwits
Easy
Par
TX
UAL
WA
##jo
##Lu
##inc
##imately
decades
215
MARK
powerful
##TION
diversify
ALERT
flying
apart
observ
FCX
A¢
Ge
XPE
ai
ib
##lined
##96
##LB
##arn
##edd
information
##ili
##ulating
greatest
136
CNBCClosing
loser
seemed
ONE
Index
Em
led
voice
##WY
##7x
##orge
##ocks
Charts
FSLR
ISRG
respond
##ttp
750
Covid
DX
HOOD
RH
Rocco
Sad
Udall
Video
ren
##vy
##Win
##With
##itness
AppleSupport
##olling
158
scary
Ref
reduce
Before
triggered
magic
Perhaps
CNBCClosingBell
Div
End
Sec
fans
jour
wire
##head
meme
probab
##ounding
blind
##ERE
sometime
relations
##apping
##101
385
Spy
depending
details
concerns
viol
Li
samsung
##lu
##pods
##IR
##well
##essions
fruit
wanting
quote
finished
vehic
##ours
decisions
brother
gross
function
Wouldn
respons
color
received
haters
fintwit
##woman2011
battle
##ij
##hr
##cles
##illed
convers
monop
##otten
declining
headphones
scalps
CHL
StocksTo
COVER
patterns
fighting
##Blog
critical
XPEV
food
mir
tier
∑ueª
##000
##olly
##angu
grind
finding
purchases
acquire
speculative
institution
safety
5c
Aus
EMA
dow
podcast
sun
##NS
##eni
inverse
AppleTV
##older
agreed
contrib
greater
emb
##holder
revolution
existing
WKHS
380
Ive
cases
##ls
##BC
##81
##enth
buff
##aming
waste
door
##anda
uns
badly
##ensive
keyboard
updated
jumping
Feels
DOGE
flipside
tastytrade
##ELP
HPQ
Gar
Henry
MF
fre
hod
##ef
##RS
threat
##term
frank
sectors
scan
display
carry
##TechStrat
bouncing
source
website
UdallTechStrat
covid
mu
##Sw
##here
##AAPL
##JR
##itting
areas
##acke
somebody
headlines
purp
entertain
collapse
WallSt
WallStreet
BTFD
struggling
##Analyst
TRADE
Ra
fil
hated
ios
song
sla
woke
##IP
##zos
##Wood
##walk
##eech
##uses
charl
MSTR
##ago
float
install
desk
##Trader99
technically
CELG
suggested
corporate
fantastic
Catwoman2011
Baham
Gree
Hul
Part
PENN
fib
nons
##ault
##dt
##rick
##kia
##NE
##VO
##29
##Pay
Though
portion
##uffett
Problem
subscrib
stories
discussed
discussion
march
annoying
dunno
Statistics
BP
EA
OTC
WM
bite
code
dinner
fal
lux
##mart
##GR
##36
##omo
##lying
lift
wash
runner
##erves
##ruary
DELL
##Private
sbux
660
Ca
Must
az
jo
##mar
##gers
##wood
##adio
##pton
whats
anybody
knowledge
##izes
##itten
emer
suppliers
biased
disclosure
osx
uu¢
skeptical
Full
LY
mot
rh
toward
##en9
##ica
secret
pullbacks
legit
exception
articles
##aBen9
##ONEY
human
vacation
LEAP
hesit
BahamaBen9
Bern
http
ie
mike
##mc
##Coo
##79
thu
##essor
intc
nov
##itted
##erts
500k
leads
predicting
experien
switched
Current
hahaha
risks
LTC
dare
eps
tun
yo
##tista
##Man
##iscal
andrew
overd
##lax
imho
evening
173
planned
oCO∏eu
sky
February
PeterTrader99
DDOG
cele
Awesome
BATtista
Btw
PB
dive
po
syn
##Wh
##WN
##onk
refr
##rading
saving
##agon
activity
ATM
Unfortunately
impossible
GEQSense
TMF
upset
speculation
hammer
vertical
JB
et
mother
wtf
##ram
##pir
##rey
##revers
##amers
chunk
##ainCapital
174
1999
##hhhh
switching
jonas
breach
##inn23
category
Mag
Penny
Q3
fi
material
pig
qcom
race
##95
##urance
##essing
##star
##outs
tradefast
##prise
produce
amazed
CHWY
CMC
included
##ui∞ui∞
conditions
Team
Totally
community
Msft
Dere
Lost
Zuck
fitzstock
ram
##IB
##Business
##etime
##otoy
upward
alive
whenever
timefr
compon
##acci
##avin
Share
Already
gtotoy
gene
CRUS
SNE
announcements
catching
##Shark
NEW
NEVER
possibility
debit
leadership
##1234
1MainCapital
Biden
##works
##irthday
fitzstockcharts
Eric
Ya
rating
##aO∏e
##UE
##Be
member
##ustin
chill
heck
clar
##argin
168
underest
bitch
continuation
##IDE
STX
creating
##eeze
disappointing
prints
influ
##conn
competitors
rallied
consistent
roughly
401k
guarantee
osxrevers
osxreverser
5th
CY
Head
LG
Wal
daugh
##ba
##Me
##Time
##35
##ask
stk
1200
STOCK
ATHs
bringing
enjoying
##investing
drag
fundamental
Overall
consistently
scratch
reduced
OMG
Gary
MV
bs
eod
ny
piss
##ds
##FF
##conom
##LV
##ingers
stab
reve
##imin
buddy
AMAT
truck
plug
##nton
cliff
strange
consensus
discord
pushed
breath
percentage
hanging
##Quinn23
Profits
local
Absolutely
jonasQuinn23
Av
Bas
DR
cs
hr
##away
##MD
##Apple
##Day
##CM
##LT
##Wall
##Jon
##wind
##ancing
##isf
wheel
hair
exer
proven
quit
struct
flows
##anges
bottomed
planet
Ann
basket
##oked
failure
predictions
opinions
gambling
eyeing
digital
Drop
Hello
VWAP
bargain
DON
EEM
Kass
Tune
Tommy
Year
jpm
micha
pool
virus
##orter
##itude
##ady
reply
##ested
##ape
yours
##raig
separ
understanding
Anthony
momo
checking
CAN
##CEL
performing
calend
blew
pennies
copy
announces
narrative
ARE
GB
Liv
cow
kyle
##mor
##RX
##Buy
##reams
notes
##icky
unb
follows
##ESS
raising
670
640
hedging
throwing
estimate
electric
silver
tbh
divergence
accurate
##Sniper
EW
FWI
giant
latter
ro
ru
tanks
##tv
##UP
##fool
##lly
##aly
quant
techs
unload
scam
Trust
acceler
##haust
snipper
standard
675
BlackB
integration
Obvious
Setting
capitulation
probability
FWIW
CT
Fund
fees
hence
oi
##fall
starter
steve
##chart
shitty
upon
##OOK
click
StockM
##acle
##ource
dia
scott
Nokia
hardly
##iley
analy
BBIG
BBBY
Seeing
Spread
##indsight
Upd
Cheers
JeffM
coinc
radar
mixed
defend
minimum
CMCSA
Hy
Ipad
Mot
Nob
eating
fash
meth
##ATrades
##can
##64
AAPLTree
2023
clown
desper
Macbook
upgrading
gaming
explained
SLB
PUTs
managers
Jonah
allocation
##payne
##jection
Portfolio
Hit
Mart
ep
jed
atm
pls
Charl
capt
Frank
littlet
reload
deserve
310
##uiµ
JPATrades
multiples
absolute
tanked
##obert
WHAT
FoxBusiness
official
Russia
bashing
Game
Our
Touch
cable
north
op
opex
##oD
##nal
##aff
stonks
##usion
SPAC
altern
trump
select
dipped
ident
strongly
older
##ITH
Biggest
##OULD
TODAY
##ynam
595
rebal
reflect
competitive
Patience
World
unlikely
monitor
##igercs
JeffMacke
littletigercs
Hear
WOW
WORK
har
##VN
##itable
infr
stable
shame
hav
bump
justify
##OOM
maker
##ahaha
charting
##ups
minor
Being
keynote
revs
trimming
laughing
loose
Sawy
Question
1B
Fly
Holy
Iron
Oil
etf
lc
pen
taught
##oni
##isa
##chie
shark
prime
doc
const
shared
##raw
Aud
##ryan
cru
##assy
runners
useless
182
Goodship
##exus
##insider
Depe
revisit
##IVN
counting
healthcare
##iotech
Consider
bleeding
ROI
Sandro
BK
Cur
MRK
WAY
YELP
sam
yep
##MM
##You
##with
##atri
##oway
##owatch
fresh
speech
died
2003
retweet
176
MACD
Proph
trending
Cramers
generation
495
biotech
crossed
Companies
frustrating
micro
##Research
Apples
behavior
celebr
Nobody
fashion
BO
Dem
Ever
FCEL
MC
pins
##Coat
##yl
thin
##anch
proof
buyout
##pts
trip
intr
NotaB
##azy
mkts
485
kicking
profile
approaching
typically
HAVE
lagging
TIME
tempor
##Talkk
InvestmentTalkk
nonsense
NotaBubble
CPI
Fast
FREE
junk
mg
pawan
##bie
##put
##arious
##ister
exhaust
plant
safer
178
grass
605
##wealth
potentially
explode
object
Johnson
GREAT
Services
segment
##Lupton
wireless
##1234o
JonahLupton
pawan1234o
410
630
CD
Event
Phone
Sup
cuts
hom
tied
##oes
##Up
##Hawk
##ores
##oted
##eeee
shr
##imm
##olt
algos
downward
163
##igned
equal
establ
steal
blowout
joining
wearing
fault
cciv
Hedgeye
Breaking
##erritt
##erMerritt
luxury
COR
POT
SIL
Wr
hike
tip
##SC
##hoo
##wan
##water
##71
##ination
##itory
##amed
lil
##icated
##arkus
##iend
sharp
100B
##ansion
##valu
Scal
yields
platforms
COMP
encou
dangerous
SawyerMerritt
4S
Sales
Use
hint
james
vict
yday
##mac
##girl
##ban
##hot
##Is
##LN
##amous
##arkCoo
doge
chose
exchange
##room
100k
##udd
##pert
Alright
##uo®
relief
Redler
equival
##Chart
views
NYC
debate
memory
replacement
uoCuoCuoC
TheMarkCoo
Under
advertising
stockstowatch
TheMarkCooke
BII
Ent
GET
HT
His
Sen
YE
sci
sessions
visit
##aven
##gl
##gor
##°O∏e
ther
##arrow
##ences
##idge
##acks
TheD
placed
spin
bynd
stretch
##rik
positioned
##INA
hourly
caused
touching
##Shirt
MORE
RobinhoodApp
BMY
Jamtrades
HLF
aug
dk
dj
mouth
##Buffett
##onn
##imarkus
##ication
##ateful
club
##agn
unreal
##avis
##ette
DID
idk
surprising
275
tele
iOS7
banking
seconds
UPTREND
##KTNew
horizon
DOWNTREND
presentation
radio
Total
##Value
constantly
Meanwhile
relationship
reveal
StockMKTNew
jedimarkus
BIIB
StockMKTNewz
jedimarkus77
Kelly
LQ
NA
Santa
bound
dry
iM
sink
##uild
##YT
##Jones
##inja
##isc
stated
##chr
##illiant
chances
##standing
disaster
continuing
INT
##ASE
increases
killer
awful
bidu
approx
Morgan
profession
climb
Started
leaning
cvpayne
straddle
522
7w
FO
MON
NCL
VIA
den
##uee
##For
##Action
##BI
##win
##anity
white
##orton
sup
##odget
Aub
uo®
drippy
##pring
##assin
Andrew
2001
Whats
strongest
##flation
Pres
##ilarious
Quant
340
estate
candid
candles
relevant
bills
recommended
Foxconn
satisf
damage
##wdennis
RevShark
correlation
kylewdennis
Obviously
CramersShirt
6s
Bel
Fi
LM
VX
hrs
##Fer
##EV
##fessor
##Pre
##ideas
earn
spce
iPhoneX
reclaim
##ports
underperform
advis
caution
Shorts
##Investing
Needs
LUV
Level
fixed
competitor
ValueAnalyst
institutional
7wtc
NCLH
ValueAnalyst1
MP
Med
Nope
Rog
dot
firms
mass
ripped
six
ts
##packer
##han
##ills
##lection
pray
lives
##plex
##unter
##unge
deals
##pects
unve
elsewhere
fills
Anything
coz
REGN
entirely
DDD
federal
Backpacker
irre
false
BackpackerFI
Mal
QTR
RIVN
Wife
blah
gi
natur
rout
td
##So
##ali
##iders
repres
##oles
chick
sma
164
##ittle
letter
##UTU
CLF
autonom
Retail
uße
Position
distribution
Dereck
Cit
Cost
DAX
IQ
IDE
Lo
Mission
Ugh
birthday
cup
dt
fee
grad
gdx
jam
peeps
sight
##lk
##Growth
##atically
##uster
upper
##ths
downt
GOOD
uo©
##nergy
Product
simpl
exclus
ARM
macbook
ACB
uncertainty
calendar
EC
Equ
Few
Join
MNYC
MONEY
Won
pointing
##nx
##aur
##pass
##2hard
##HI
##worth
##inary
##oses
stocktwits
fraction
TheSt
##ollars
169
166
bright
expansion
SEE
SOX
standing
treat
broader
freaking
daughter
drippy2hard
MNYCx
BR
Fort
KM
OIL
Ugo
bored
der
feb
hbl
om
warr
##ren
##rop
##gu
##bob
inev
##thew
somewhat
leap
big7x
address
161
##uphor
useful
advise
substant
##cln
examples
666
disappointment
GOLD
complaining
Intel
##Squawk
##etzold
##Coatney
DereckCoatney
hblodget
big7x7
2T
EB
Ill
Uber
fish
hole
passive
wedge
##tec
##YE
##omp
##aman
##gel
##antoli
##akeven
knock
2005
parts
glass
##gged
Exce
insurance
storage
hurts
##leyfool
VRX
apolog
SIRI
luv
##Winners
Covered
Slow
lv
oct
sy
##bart
##fa
##onz
##osi
##otions
##una
wouldnt
suit
concept
##pend
hadn
context
cris
realmoney
ending
sets
3000
changer
fading
thousands
Peloton
Lot
NX
PAY
Tra
Tri
achie
dust
dil
mut
rare
##tm
##vable
##esp
##ompl
##lead
AMRN
##ooked
ApplePay
##abet
##ague
morn
IND
scaling
crashing
Uncle
##ARN
Volat
CALLs
exceed
status
##Success
tablets
hmmm
screaming
conversation
michaels
COP
Congr
Main
Roth
Tough
TOP
rig
vari
¨aO∏e
##r1
##ei
##iu
##Mot
##LZ
##Petzold
##orse
##ornton
##itcy
##asury
noted
##icious
fraud
nowhere
overweight
knife
believer
##OME
expand
currency
##iking
##ipster
##Real
##ARS
Early
pinned
wallet
Keene
hedges
Company
reference
Starting
HenryPetzold
Prophitcy
MissionWinners
michaelsantoli
Brand
Norm
OXY
SC
dee
gad
pipe
pcln
##funds
##4Success
##WE
##72
item
##chatter
meh
##artners
exits
##unger
##osteve
smash
##obe
##oung
##NGA
171
bottoms
fallen
helpful
##ETS
325
Conf
weighting
